mx1 = [[1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 1, 1],
        [0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1],
        [1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1],
        [1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1],
        [1, 0, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1],
        [1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1],
        [1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 1],
        [1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1],
        [1, 1, 1, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 1],
        [1, 1, 1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1]]

mx2 = [[1, 2, 3, 4, 5, 6, 7, 8, 9, 8, 7, 6, 5, 4, 3],
        [2, 3, 4, 5, 6, 7, 8, 9, 8, 7, 6, 5, 4, 3, 2],
        [3, 4, 5, 6, 7, 8, 9, 8, 7, 6, 5, 4, 3, 2, 1],
        [4, 5, 6, 7, 8, 9, 8, 7, 6, 5, 4, 3, 2, 1, 2],
        [5, 6, 7, 8, 9, 8, 7, 6, 5, 4, 3, 2, 1, 2, 3],
        [6, 7, 8, 9, 8, 7, 6, 5, 4, 3, 2, 1, 2, 3, 4],
        [7, 8, 9, 8, 7, 6, 5, 4, 3, 2, 1, 2, 3, 4, 5],
        [8, 9, 8, 7, 6, 5, 4, 3, 2, 1, 2, 3, 4, 5, 6],
        [9, 8, 7, 6, 5, 4, 3, 2, 1, 2, 3, 4, 5, 6, 7],
        [8, 7, 6, 5, 4, 3, 2, 1, 2, 3, 4, 5, 6, 7, 8]]

mx = [[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1],
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]]

arr1 = [] # Массив для сумм числа
arr2 = [] # Массив для "плохих" строк числа
arr3 = [] # Пустой массив для фокусов

y = 0 # Для подсчёта сумм числа
z = 0 # Для подсчёта сумм числа
m = 0 # Для увеличения/уменьшения на единицу
n = 0 # Для увеличения/уменьшения на единицу
i = 0 # Для сравнения сумм числа
w = 0 # Для суммы числа
k = 0 # Для прохода по всем цифрам
empty = 0

R = 28
S = 1
t = 0 # 4

while empty < 10: # Настройка
    while k < 10:
        while y < 10: # Нахождение сумм для одного числа
            while z < 15:
                w = w + mx1[k][z] * mx2[y][z]
#                print(w)
                z = z + 1
            arr1.append(w)
            y = y + 1
            w = 0
            z = 0
        y = 0
#        print(arr1)
    
        while i < 10: # Проверка сумм на выявление наибольшего нужного нам
            if i == k:
                pass
            elif arr1[k] > arr1[i]:
                pass
            else:
                arr2.append(i)
            i = i + 1
        i = 0
#        print(arr2)

        if arr2 == arr3: # Кнут и пряник
#            print("Empty array!")
            empty = empty + 1
        else:
            while z < 15: # Пряник
                mx2[k][z] = mx2[k][z] + mx1[k][z]
                z = z + 1
            z = 0
            while arr2 != arr3: # Кнут
                i = arr2[0]
                del arr2[0]
                while z < 15:
                    mx2[i][z] = mx2[i][z] - mx1[k][z]
                    z = z + 1
                z = 0
            empty = 0
#        print(empty)
#        print(mx2)
        k = k + 1
#        print(k)
#        t = t + 1
#        print(t)
        arr2 = []
        arr1 = []
        i = 0
#        print(mx2)
        if empty == 10:
            S = 0
            break
    k = 0
print(mx2)

k = 0 # Для прохода по всем цифрам
w = 0 # Для суммы числа
y = 0 # Для подсчёта сумм числа
z = 0 # Для подсчёта сумм числа
m = 0 # Для увеличения/уменьшения на единицу
n = 0 # Для увеличения/уменьшения на единицу
i = 0 # Для сравнения сумм числа
SS = 1

print("Введите, пожалуйста, число для распознавания: ")
try:
    x = int(input())
    if x > 9:
        print("ERROR!")
    elif x < 0:
        print("ERROR!")
    else:
        while SS == 1: # Настройка
            while y < 10: # Нахождение сумм для одного числа
                while z < 15:
                    w = w + mx1[x][z] * mx2[y][z]
#                print(w)
                    z = z + 1
                arr1.append(w)
                y = y + 1
                w = 0
                z = 0
            y = 0
#        print(arr1)

            while i < 10: # Проверка сумм на выявление наибольшего нужного нам
                if i == 4:
                    pass
                elif arr1[4] > arr1[i]:
                    pass
                else:
                    arr2.append(i)
                i = i + 1
            i = 0
            SS = 0
#        print(arr2)
        if arr2 == arr3:
            print("Число распознано! Это 4.")
        else:
            print("Это не 4!")
except ValueError:
    print("Это точно цифра?")
